app/Http/Controllers/Admin/PetugasController.php

    public function index(Request $request)
    {
        $query = Petugas::with(['user', 'zona'])
            ->whereHas('user', function ($q) {
                $q->where('role', 'petugas');
            });

        // Filter search
        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function($q) use ($search) {
                $q->where('nip', 'like', "%{$search}%")
                  ->orWhereHas('user', function($u) use ($search) {
                      $u->where('name', 'like', "%{$search}%")
                        ->orWhere('email', 'like', "%{$search}%");
                  });
            });
        }

        // Filter status
        if ($request->filled('status')) {
            $query->where('status_tersedia', $request->status);
        }

        // Filter zona
        if ($request->filled('zona')) {
            $query->where('zona_id', $request->zona);
        }

        $petugas = $query->latest()->paginate(10)->withQueryString();

        $stats = [
            'total' => Petugas::count(),
            'tersedia' => Petugas::where('status_tersedia', 'tersedia')->count(),
            'sibuk' => Petugas::where('status_tersedia', 'sibuk')->count(),
            'tidak_aktif' => Petugas::where('status_tersedia', 'tidak_aktif')->count(),
        ];

        $zonas = ZonaWilayah::where('is_active', true)->orderBy('nama_zona')->get();
---
select count(*) as aggregate from `petugas`
select * from `users` where `users`.`id` in (3, 5)
select count(*) as aggregate from `petugas` where `status_tersedia` = 'tersedia'
select count(*) as aggregate from `petugas` where `status_tersedia` = 'sibuk'
select count(*) as aggregate from `petugas` where `status_tersedia` = 'tidak_aktif'
select * from `zona_wilayah` where `is_active` = 1 order by `nama_zona` asc

    public function edit(Petugas $petugas)
    {
        $petugas->load(['user', 'zona']);
        $zonas = ZonaWilayah::where('is_active', true)->orderBy('nama_zona')->get();
---
select * from `users` where `users`.`id` in (3, 5)
select * from `zona_wilayah` where `is_active` = 1 order by `nama_zona` asc