app/Http/Controllers/Admin/PetugasController.php

    private function generateNip(): string
    {
        $tahun  = now()->format('Y');
        $prefix = "PEG-{$tahun}-";

        // Ambil NIP terakhir tahun ini dan tambah 1
        $last = Petugas::where('nip', 'like', $prefix . '%')
            ->orderByDesc('nip')
            ->value('nip');
---
select `nip` from `petugas` where `nip` like 'PEG-2026-%' order by `nip` desc limit 1

    public function index(Request $request)
    {
        $query = Petugas::with(['user', 'zones', 'zona'])
            ->latest();

        // Filter pencarian berdasarkan nama atau NIP
        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->whereHas('user', function ($sq) use ($search) {
                    $sq->where('name', 'like', "%{$search}%")
                      ->orWhere('email', 'like', "%{$search}%");
                })->orWhere('nip', 'like', "%{$search}%");
            });
        }

        // Filter berdasarkan status
        if ($request->filled('status')) {
            $query->where('status_tersedia', $request->status);
        }

        // Filter berdasarkan zona (bisa pivot atau fallback)
        if ($request->filled('zona_id')) {
            if ($request->zona_id === 'tanpa_zona') {
                $query->whereDoesntHave('zones')->whereNull('zona_id');
            } else {
                $query->where(function ($q) use ($request) {
                    $q->whereHas('zones', function ($sq) use ($request) {
                        $sq->where('zona_wilayah.id', $request->zona_id);
                    })->orWhere('zona_id', $request->zona_id);
                });
---
select * from `zona_wilayah` where `zona_wilayah`.`id` in (1, 3)