app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        $users = User::when($request->search, function ($q, $v) {
                $q->where(function($q) use ($v) {
                    $q->where('name', 'like', "%{$v}%")
                      ->orWhere('email', 'like', "%{$v}%")
                      ->orWhere('username', 'like', "%{$v}%");
                });
            })
            ->when($request->role, fn ($q, $v) => $q->where('role', $v))
            ->when($request->filled('is_active'), fn ($q) => $q->where('is_active', $request->boolean('is_active')))
            ->when($request->zona_id, function ($q, $v) {
                $q->whereHas('petugas', fn ($pq) => $pq->where('zona_id', $v));
            })
            ->with('petugas.zona')
            ->orderByDesc('created_at')
            ->paginate(15)
            ->withQueryString();

        $stats = [
            'total'      => User::count(),
            'admin'      => User::where('role', 'admin')->count(),
            'supervisor' => User::where('role', 'supervisor')->count(),
            'petugas'    => User::where('role', 'petugas')->count(),
            'masyarakat' => User::where('role', 'masyarakat')->count(),
        ];

        $zonas = ZonaWilayah::where('is_active', true)->orderBy('nama_zona')->get();
---
select * from `petugas` where `petugas`.`user_id` in (1, 2, 3, 4, 5, 6, 7)
select * from `users` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `role` = 'masyarakat' and year(`created_at`) = '2026'
select count(*) as aggregate from `users` where `role` = 'admin' and year(`created_at`) = '2026'
select count(*) as aggregate from `users` where `role` = 'supervisor' and year(`created_at`) = '2026'
select count(*) as aggregate from `users` where `role` = 'petugas' and year(`created_at`) = '2026'
select * from `zona_wilayah` where `is_active` = 1 order by `nama_zona` asc

    public function store(StoreUserRequest $request)
    {
        DB::transaction(function () use ($request) {
            $fotoPath = null;
            if ($request->hasFile('foto_profil')) {
                $fotoPath = $request->file('foto_profil')->store('profile_photos', 'public');
            }

            // Auto-generate NIP berdasarkan role
            $prefix = match($request->role) {
                'admin'      => 'ADM',
                'supervisor' => 'SPV',
                'petugas'    => 'PEG',
                default      => 'MSY',
            };
            $year  = date('Y');
            $count = User::where('role', $request->role)
                         ->whereYear('created_at', $year)
                         ->count() + 1;
            $nip = sprintf("%s-%s-%04d", $prefix, $year, $count);

            $user = User::create([
                'nip'         => $nip,
---
select count(*) as aggregate from `users` where `role` = 'admin' and year(`created_at`) = '2026'