app/Http/Controllers/Admin/UserController.php

insert into `users` (`nip`, `name`, `email`, `username`, `password`, `role`, `no_telepon`, `foto_profil`, `is_active`, `updated_at`, `created_at`) values ('ADM-2026-0002', 'Zoewita Huwaida', 'zoewita@pdam.go.id', 'zoewitaa', '$2y$10$kAeqXislL3R0pDDtaPcZC.pGSxTkQ2QktedssZ/aTFbjWGSnkMZqe', 'admin', '085812345678', 'profile_photos/8C6wx5qCmiklgakf3odS4bqnNJPoJKoCxQsmNSa0.jpg', 1, '2026-06-11 15:27:36', '2026-06-11 15:27:36')
---
    public function store(Request $request)
    {
        $request->validate([
            'name'       => 'required|string|max:255',
            'email'      => 'required|email|unique:users,email',
            'password'   => 'required|string|min:8|confirmed',
            'role'       => 'required|in:admin,supervisor,petugas,masyarakat',
            'no_telepon' => 'nullable|string|max:20',
            'is_active'  => 'boolean',
        ], [
            'email.unique' => 'Email sudah digunakan oleh pengguna lain.',
        ]);

        User::create([
            'name'       => $request->name,
            'email'      => $request->email,
            'password'   => Hash::make($request->password),
            'role'       => $request->role,
            'no_telepon' => $request->no_telepon,
            'is_active'  => $request->boolean('is_active', true),
        ]);